https://medium.com/@shouke.wei/convenient-methods-to-identify-and-drop-duplicate-rows-with-pandas-27fc7ab53304

In [1]:
import pandas as pd

# Creating a sample DataFrame
data = {'A': [1, 2, 1, 2, 1],
        'B': ['apple', 'banana', 'apple', 'banana', 'apple'],
        'C': [10, 20, 10, 20, 10]}
df = pd.DataFrame(data)
df

   A       B   C
0  1   apple  10
1  2  banana  20
2  1   apple  10
3  2  banana  20
4  1   apple  10

In [2]:
# Finding duplicate rows
duplicate_rows = df.duplicated()
duplicate_rows

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [4]:
df.drop_duplicates(inplace=True)
df

   A       B   C
0  1   apple  10
1  2  banana  20

In [5]:
import pandas as pd

# Creating a sample DataFrame
data = {'A': [1, 2, 3, 4, 5],
        'B': ['apple', 'banana', 'apple', 'banana', 'apple'],
        'C': [10, 20, 10, 20, 10]}
df_new = pd.DataFrame(data)
df_new

   A       B   C
0  1   apple  10
1  2  banana  20
2  3   apple  10
3  4  banana  20
4  5   apple  10

In [6]:
# Finding duplicate rows
dup_rows1 = df_new.duplicated()
dup_rows1

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [7]:
import pandas as pd

# Creating a sample DataFrame
data = {'A': [1, 2, 3, 4, 5],
        'B': ['apple', 'banana', 'apple', 'banana', 'apple'],
        'C': [10, 20, 10, 20, 10]}
df_new = pd.DataFrame(data)
df_new

   A       B   C
0  1   apple  10
1  2  banana  20
2  3   apple  10
3  4  banana  20
4  5   apple  10

In [8]:
# Finding duplicate rows
dup_rows1 = df_new.duplicated()
dup_rows1

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [9]:
# Finding duplicate rows
dup_rows2 = df_new.duplicated(subset=['B','C'])
dup_rows2

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [10]:
df_no_duplicates1 = df_new.drop_duplicates(subset=['B'],keep="first", inplace=False)
df_no_duplicates1

   A       B   C
0  1   apple  10
1  2  banana  20